** for...of
   #+BEGIN_SRC js
  let users = ["Farhad", "Pouri", "Jack"];

  for(let name of users) {
    console.log(name);
  }
   #+END_SRC
   #+RESULTS:
   : Farhad
   : Pouri
   : Jack
   : undefined

** String Key/Values With Map
   :NOTE:
   1) The =Map= object is a simple key/value data structure. Any value may
      be used as either a key or a value, and objects are not converted to
      strings.
   2) Maps are iterable, so they can be used in a for...of loop. Each run
      of the loop returns a *[key, value]* pair for an entry in the Map
   :END:
   #+BEGIN_SRC js
  let user1 = { name: "Farhad" };
  let user2 = { name: "Pouri" };

  let totalReplies = new Map();

  totalReplies.set(user1, 5);
  totalReplies.set(user2, 42);

  console.log(totalReplies.get(user1)); // 5
  console.log(totalReplies.get(user2)); // 42

  for (let [key, value] of totalReplies) { // Great use of array destructuring
    console.log(key);
    console.log(value);
  }
   #+END_SRC
   #+BEGIN_SRC js
   const person = new Map();

   person.set("name", "Farhad");
   person.set("family", "hsni");

   console.log(
   person.get("name"),           // Farhad
   person.size,                  // 2
   person.has("name"),           // true
   person.delete("name"),        // true
   person.has("name")            // false
   );

   #+END_SRC
   #+BEGIN_SRC js
     const person = new Map([
       ["name", "Farhad"],
       ["family", "hsni"]
     ]);

     console.log(
       person.get("name"),           // Farhad
       person.get("family"),         // hsni
       person.size,                  // 2
       person.has("name"),           // true
       person.delete("name"),        // true
       person.has("name")            // false
     );
   #+END_SRC
   #+BEGIN_SRC js
     const person = new Map([
       ["name", "Farhad"],
       ["family", "hsni"]
     ]);

     for(let key of person.keys()) {
       console.log(key);
     }
     for(let key of person.values()) {
       console.log(key);
     }
     // for(let key of person.entries()) {
     //   console.log(key);
     // }

   #+END_SRC
   #+RESULTS:
   : name
   : family
   : Farhad
   : hsni
   : undefined

*** =String.prototype.endsWith=
#+BEGIN_SRC js
const title = "Red Rising";

console.log(
  title.endsWith("Red")
);
#+END_SRC

#+RESULTS:
: false
: undefined

*** =String.prototype.repeat=
#+BEGIN_SRC js
const str = "Hi";
console.log(str.repeat(3))
#+END_SRC

#+RESULTS:
: HiHiHi
: undefined

*** =Array.prototype.find=
#+BEGIN_SRC js
const foo = ["one", 2, "fhd", "hsni"];
console.log(foo.find(item => typeof item == "number"));
#+END_SRC

#+RESULTS:
: 2
: undefined
*** =Array.prototype.findIndex=
#+BEGIN_SRC js
const foo = ["one", 2, "fhd", "hsni"];
console.log(foo.findIndex(item => typeof item == "number"));
#+END_SRC

#+RESULTS:
: 1
: undefined

